// --------------------------------------------------
// Подключение библиотек
// --------------------------------------------------

const express = require('express')
const http = require('http')
const socket = require('socket.io')
const useragent = require('express-useragent')
const mysql = require('mysql2/promise')
const config = require('../server.config')


// --------------------------------------------------
// Создание сервера http/socket
// --------------------------------------------------

/**
 * Объект фреймворка Express
 */
const app = express()

/**
 * Http сервер, созданный через http.createServer()
 */
const server = http.createServer(app)

/**
 * Свойство хранит объект Socket.io, подключенный к
 * серверу созданный через http.createServer()
 */
app.io = socket(server)

/**
 * Свойство хранит объект с объектами подключения
 * к базам данных
 */
app.db = {
    mysql: mysql.createPool(config.db.mysql)
};


// --------------------------------------------------
// Настройка socket части сервера
// --------------------------------------------------

/**
 * Промежуточный обработчик, производящий идентификацию пользователя
 * при подключении к socket части сервера
 */
app.io.use(require('./identificationSocket'))


// --------------------------------------------------
// Настройка http части сервера
// --------------------------------------------------

/**
 * Парсер заголовка user-agent ( Для определения браузера )
 */
app.use(useragent.express())

/**
 * Подключение роутеров к серверу
 */
require('./routers')(app)


// --------------------------------------------------
// Запуск сервера
// --------------------------------------------------

server.listen(config.port,()=>{
    console.log('Сервер запущен. Используемый порт: '+config.port)
})